README.org
#+TITLE: Data and Analysis for "When Sensing is Gambling"
#+AUTHOR: Colin S Maxwell and Paul M Magwene
#+DATE: January 2017

* Introduction

This document describes the data submitted to the Dryad repository for
the paper "When Sensing is Gambling: An Experimental System Reveals
how Plasticity can Generate Tunable Bet-Hedging Strategies" and
provides links to the code (or the code itself) used to generate
figures and the statistical analysis in the paper. This document is
written in [[http:orgmode.org][org-mode]] format, and is best viewed using emacs--an
open-source text editor. If this document is viewed on github, links
don't necessarily point to the correct sections, and the results of
source blocks (see below) are not displayed. If you want to look at
this document in a web-browser, we recommend cloning the repo and
examining [[file:README.html][this HTML]] document that was exported from org-mode instead.

The scripts used to produce the figures are stand-alone files linked
to in the section [[figs][Scripts used to generate figures]].

If you are viewing this on github, the links in this document won't work.

Statistics referenced in the text are listed in the sections
[[results][Statistics for Results]]. The code used to generate the statistics is
shown in [[http://orgmode.org/worg/org-contrib/babel/][org-babel]] format, and can be run /in situ/ in emacs. The
results of each code block is shown below it, giving the statistic of
interest.

The actual data submitted to Dryad is in the folder [[file:2017-Maxwell-Magwene-when-sensing-is-gambling]]



* Requirements

The analysis is written in the R programming language. See the section
[[session][Session Info]] for the version of R and the packages used to run these
analyses. The scripts assume that all data data and scripts are in the
same folder.

* Files in this submission

This section contains a list of the data files included in this
submission and gives:

1) A brief description of how the data were generated
2) The name of the script (if any) that produced the data
3) A description of the column names in the data, or the metadata for
   the files


** 2017-Maxwell-Magwene-when-sensing-is-gambling-fig3.csv
   
This is a file that gives the data used to generate Figure 3. The goal
of this set of experiments was to determine the ability of different
genotypes to grow in SC+5FOA and SC-ura media in different
concentrations of estradiol. Each culture was measured at the
beginning and end of a 24hr growth period. This file was generated by
[[file:process-tradeoffs-fig3.R]], which collates raw data in a folder not
submitted to Dryad.

------------------------------------------------------------

- rep :: Replicate number
- media :: Type of media
- estradiol :: Concentration of estradiol in the media (nM)
- strain :: The CMY number of the yeast strain
- ura3 :: Genotype of the strain at the URA3 locus
- post :: Concentration of cells at the end of the period of growth (cells/nl)
- pre :: Concentration of cells at the beginning of the period of growth (cells/nl)

** 2017-Maxwell-Magwene-when-sensing-is-gambling-fig4.csv


This is a file that gives the data used to generate Figure 4. The goal
of this set of experiments was to determine if strain that was plastic
to the concentration of estradiol was pursuing a bet-hedging strategy
in an environment with estradiol gradients and that alternated between
SC-ura and SC+5FOA selection. This file was generated by
[[file:process-competitions-fig4.R]], which collates raw data in a folder
not submitted to Dryad.

------------------------------------------------------------

- replicate :: Eeplicate number
- epoch :: Epoch in the competition
- pool :: Which competition treatment does the 
- treatment :: Did the competition start with selection on SC+5FOA or SC-ura?
- name :: The gate that the observation records information about. For
     example, the mCherry cells, or the unstained cells.
- =percent_cells= :: The percent of the cells measured that were of that
     type (e.g. unstained, mCherry, etc.)
- Count.mL :: Concentration of cells in the observation (cells/ml)
- Count :: Number of cells collected in the observation

** 2017-Maxwell-Magwene-when-sensing-is-gambling-fig5-and-figS2.csv

This is a file that gives the data used to generate Figure 5 and
Supplementary Figure 2. The goal of this experiment was to determine
if the /plastic/ strain had a lower fitness than specialist
strains. This file was generated by
[[file:process-liquid-competitions-fig5.R]], which collates raw data in a
folder not submitted to Dryad.

------------------------------------------------------------

- replicate :: replicate number
- gate :: The gate that the observation records information
     about. Either "mCherry" for the /(red)/ cells or "GFP" for the
     /(green)/ cells.
- media :: Media that the cells were grown in. SC-ura is E1 and
     SC+5FOA is E2.
- estradiol :: Concentration of estradiol in the media.
- =group_name= :: The competition experiment. An mCherry tagged version
     of the plastic strain was competed against a GFP tagged version
     of the plastic strain ("mCherry-vs-GFP"). An mCherry tagged
     version of the plastic strain was competed against either a
     /ura3/ (P2) strain ("vs-ura3") or a /URA3/ (P1) strain
     ("vs-URA3").
- postselection :: Number of cells counted for that observation after
     selection (diluted 1:50)
- preselection :: Number of cells counted for that observation before
     selection (no dilution)

