README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-20 Fri 12:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data and Analysis for "When Sensing is Gambling"</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin S Maxwell and Paul M Magwene" />
</head>
<body>
<div id="content">
<h1 class="title">Data and Analysis for "When Sensing is Gambling"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org697f072">1. Introduction</a></li>
<li><a href="#orge101829">2. Requirements</a></li>
<li><a href="#orgb9a1c3d">3. Files in this submission</a>
<ul>
<li><a href="#org179585f">3.1. 2017-Maxwell-Magwene-when-sensing-is-gambling-fig3.csv</a></li>
<li><a href="#org7e5d592">3.2. 2017-Maxwell-Magwene-when-sensing-is-gambling-fig4.csv</a></li>
<li><a href="#org1f938c4">3.3. 2017-Maxwell-Magwene-when-sensing-is-gambling-fig5-and-figS2.csv</a></li>
<li><a href="#orgd6add3a">3.4. 2017-Maxwell-Magwene-when-sensing-is-gambling-fig6.csv</a></li>
<li><a href="#org56acdff">3.5. 2017-Maxwell-Magwene-when-sensing-is-gambling-figS1a.csv</a></li>
<li><a href="#org87b872d">3.6. 2017-Maxwell-Magwene-when-sensing-is-gambling-figS1b.csv</a></li>
<li><a href="#org743e740">3.7. jpeg-scans</a></li>
</ul>
</li>
<li><a href="#org4d3b818">4. Scripts used to generate the data files</a></li>
<li><a href="#orgece2543">5. Miscellaneous code</a></li>
<li><a href="#org8eaa341">6. Scripts used to create shared data sets</a></li>
<li><a href="#org2e02b96">7. Scripts used to generate figures</a></li>
<li><a href="#org6db644f">8. Statistics for Results</a>
<ul>
<li><a href="#orgac319dd">8.1. No detectable cost of plasticity in E1 media</a></li>
<li><a href="#orgf21fe0e">8.2. Strong cost of plasticity in E2 media</a></li>
<li><a href="#orgeb0cad5">8.3. No significant effect of the fluorescent tag on the cost of plasticity</a></li>
<li><a href="#org805b26a">8.4. Mutation alters the diversification strategy of the plastic strain</a></li>
</ul>
</li>
<li><a href="#orgdd17b9e">9. Session Info</a></li>
</ul>
</div>
</div>

<div id="outline-container-org697f072" class="outline-2">
<h2 id="org697f072"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the data submitted to the Dryad repository for
the paper "When Sensing is Gambling: An Experimental System Reveals
how Plasticity can Generate Tunable Bet-Hedging Strategies" and
provides links to the code (or the code itself) used to generate
figures and the statistical analysis in the paper. This document is
written in <a href="http:orgmode.org">org-mode</a> format, and is best viewed using emacs&#x2013;an
open-source text editor. If this document is viewed on github, links
don't necessarily point to the correct sections, and the results of
source blocks (see below) are not displayed. If you want to look at
this document in a web-browser, we recommend cloning the repo and
examining <a href="README.html">this HTML</a> document that was exported from org-mode instead.
</p>

<p>
The scripts used to produce the figures are stand-alone files linked
to in the section <a href="#org888a29a">Scripts used to generate figures</a>.
</p>

<p>
Statistics referenced in the text are listed in the sections
<a href="#org607a72e">Statistics for Results</a>. The code used to generate the statistics is
shown in <a href="http://orgmode.org/worg/org-contrib/babel/">org-babel</a> format, and can be run <i>in situ</i> in emacs. The
results of each code block is shown below it, giving the statistic of
interest.
</p>
</div>
</div>

<div id="outline-container-orge101829" class="outline-2">
<h2 id="orge101829"><span class="section-number-2">2</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
<p>
The analysis is written in the R programming language. See the section
<a href="#orgf32328a">Session Info</a> for the version of R and the packages used to run these
analyses. The scripts assume that all data data and scripts are in the
same folder.
</p>
</div>
</div>

<div id="outline-container-orgb9a1c3d" class="outline-2">
<h2 id="orgb9a1c3d"><span class="section-number-2">3</span> Files in this submission</h2>
<div class="outline-text-2" id="text-3">
<p>
This section contains a list of the data files included in this
submission and gives:
</p>

<ol class="org-ol">
<li>A brief description of how the data were generated</li>
<li>The name of the script (if any) that produced the data</li>
<li>A description of the column names in the data, or the metadata for
the files</li>
</ol>
</div>


<div id="outline-container-org179585f" class="outline-3">
<h3 id="org179585f"><span class="section-number-3">3.1</span> 2017-Maxwell-Magwene-when-sensing-is-gambling-fig3.csv</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is a file that gives the data used to generate Figure 3. The goal
of this set of experiments was to determine the ability of different
genotypes to grow in SC+5FOA and SC-ura media in different
concentrations of estradiol. Each culture was measured at the
beginning and end of a 24hr growth period. This file was generated by
<a href="process-tradeoffs-fig3.R">process-tradeoffs-fig3.R</a>, which collates raw data in a folder not
submitted to Dryad.
</p>

<hr  />

<dl class="org-dl">
<dt>rep</dt><dd>Replicate number</dd>
<dt>media</dt><dd>Type of media</dd>
<dt>estradiol</dt><dd>Concentration of estradiol in the media (nM)</dd>
<dt>strain</dt><dd>The CMY number of the yeast strain</dd>
<dt>ura3</dt><dd>Genotype of the strain at the URA3 locus</dd>
<dt>post</dt><dd>Concentration of cells at the end of the period of growth (cells/nl)</dd>
<dt>pre</dt><dd>Concentration of cells at the beginning of the period of growth (cells/nl)</dd>
</dl>
</div>
</div>

<div id="outline-container-org7e5d592" class="outline-3">
<h3 id="org7e5d592"><span class="section-number-3">3.2</span> 2017-Maxwell-Magwene-when-sensing-is-gambling-fig4.csv</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is a file that gives the data used to generate Figure 4. The goal
of this set of experiments was to determine if strain that was plastic
to the concentration of estradiol was pursuing a bet-hedging strategy
in an environment with estradiol gradients and that alternated between
SC-ura and SC+5FOA selection. This file was generated by
<a href="process-competitions-fig4.R">process-competitions-fig4.R</a>, which collates raw data in a folder
not submitted to Dryad.
</p>

<hr  />

<dl class="org-dl">
<dt>replicate</dt><dd>Eeplicate number</dd>
<dt>epoch</dt><dd>Epoch in the competition</dd>
<dt>pool</dt><dd>Which competition treatment does the</dd>
<dt>treatment</dt><dd>Did the competition start with selection on SC+5FOA or SC-ura?</dd>
<dt>name</dt><dd>The gate that the observation records information about. For
example, the mCherry cells, or the unstained cells.</dd>
<dt><code>percent_cells</code></dt><dd>The percent of the cells measured that were of that
type (e.g. unstained, mCherry, etc.)</dd>
<dt>Count.mL</dt><dd>Concentration of cells in the observation (cells/ml)</dd>
<dt>Count</dt><dd>Number of cells collected in the observation</dd>
</dl>
</div>
</div>

<div id="outline-container-org1f938c4" class="outline-3">
<h3 id="org1f938c4"><span class="section-number-3">3.3</span> 2017-Maxwell-Magwene-when-sensing-is-gambling-fig5-and-figS2.csv</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This is a file that gives the data used to generate Figure 5 and
Supplementary Figure 2. The goal of this experiment was to determine
if the <i>plastic</i> strain had a lower fitness than specialist
strains. This file was generated by
<a href="process-liquid-competitions-fig5.R">process-liquid-competitions-fig5.R</a>, which collates raw data in a
folder not submitted to Dryad.
</p>

<hr  />

<dl class="org-dl">
<dt>replicate</dt><dd>replicate number</dd>
<dt>gate</dt><dd>The gate that the observation records information
about. Either "mCherry" for the <i>(red)</i> cells or "GFP" for the
<i>(green)</i> cells.</dd>
<dt>media</dt><dd>Media that the cells were grown in. SC-ura is E1 and
SC+5FOA is E2.</dd>
<dt>estradiol</dt><dd>Concentration of estradiol in the media.</dd>
<dt><code>group_name</code></dt><dd>The competition experiment. An mCherry tagged version
of the plastic strain was competed against a GFP tagged version
of the plastic strain ("mCherry-vs-GFP"). An mCherry tagged
version of the plastic strain was competed against either a
<i>ura3</i> (P2) strain ("vs-ura3") or a <i>URA3</i> (P1) strain
("vs-URA3").</dd>
<dt>postselection</dt><dd>Number of cells counted for that observation after
selection (diluted 1:50)</dd>
<dt>preselection</dt><dd>Number of cells counted for that observation before
selection (no dilution)</dd>
</dl>
</div>
</div>
