README.org
** 2017-Maxwell-Magwene-when-sensing-is-gambling-fig6.csv

This is a file that gives the data used to generate Figure 6. The goal
of this experiment was to determine if mutation altered the
diversification strategies of the /plastic/ strain. This file was
generated by [[file:process-images-fig6.R]], which collates the cropped
image data into a csv file.

------------------------------------------------------------

- file :: Image used to generate the data
- =pixels_from_center= :: number of pixels from the center of the plate
- intensity :: Maximum intensity of that "column" of pixels.
- strain :: CMY number of the strain being measured
- media	:: The media used to prepare the plate
- replicate :: replicate number

** 2017-Maxwell-Magwene-when-sensing-is-gambling-figS1a.csv

These data are optical density readings for cultures of yeast grown in
different concentrations of SC+5FOA media and different concentrations
of estradiol. The goal was to determine which degron tag on URA3 would
allow for conditional growth on both SC-ura and SC+5FOA. This file was
generated by [[file:process-degron-tag-figS1.R]].

------------------------------------------------------------

- row :: row on 96-well plate
- col :: column on 96-well plate
- strain :: strain number of yeast
- ura3 :: genotype of strain at the URA3 locus
- estradiol :: concentration of estradiol in the media
- X5FOA :: concentration of 5FOA in the media
- value :: optical density of the well

** 2017-Maxwell-Magwene-when-sensing-is-gambling-figS1b.csv

These data are optical density readings for cultures of yeast grown in
SC-ura media and different concentrations of estradiol. The goal was
to determine which degron tag on URA3 would allow for conditional
growth on both SC-ura and SC+5FOA. This file was generated by
[[file:process-degron-tag-figS1.R]].


- row :: row on 96-well plate
- col :: column on 96-well plate
- strain :: strain number of yeast
- ura3 :: genotype of strain at the URA3 locus
- estradiol :: concentration of estradiol in the media
- value :: optical density of the well

** jpeg-scans

These are JPEG files of the original tif files used to produce Figs. 2
and 6. Note that Figure 2 was produced from replicate 1 and Figure 6B
was produced with files from replicate 2.

#+CAPTION: Meta-data for the raw scans of plates used to generate Fig. 6 
| file                                  | strain | media | replicate |
|---------------------------------------+--------+-------+-----------|
| =pdr5snq2_24hr002_cell18_cell28.jpeg= |    121 | SC+5FOA   |         1 |
| =pdr5snq2_24hr002_cell20_cell32.jpeg= |    136 | SC+5FOA   |         1 |
| =pdr5snq2_24hr002_cell21_cell33.jpeg= |    111 | SC+5FOA   |         1 |
| =pdr5snq2_24hr002_cell22_cell34.jpeg= |    121 | SC-ura   |         1 |
| =pdr5snq2_24hr002_cell23_cell35.jpeg= |    136 | SC-ura   |         1 |
| =pdr5snq2_24hr002_cell24_cell36.jpeg= |    111 | SC-ura   |         1 |
| =pdr5snq2_24hr002_cell25_cell37.jpeg= |    115 | SC+5FOA   |         1 |
| =pdr5snq2_24hr002_cell26_cell38.jpeg= |    115 | SC-ura   |         1 |
| =24hr005_cell1_cell2.jpeg=            |    121 | SC+5FOA   |         2 |
| =24hr005_cell2_cell3.jpeg=            |    121 | SC-ura   |         2 |
| =24hr005_cell3_cell4.jpeg=            |    115 | SC+5FOA   |         2 |
| =24hr005_cell4_cell1.jpeg=            |    115 | SC-ura   |         2 |
| =24hr001_cell1_cell9.jpeg=            |    136 | SC+5FOA   |         3 |
| =24hr001_cell2_cell10.jpeg=           |    121 | SC+5FOA   |         3 |
| =24hr001_cell3_cell12.jpeg=           |    115 | SC+5FOA   |         3 |
| =24hr001_cell4_cell13.jpeg=           |    111 | SC+5FOA   |         3 |
| =24hr001_cell5_cell17.jpeg=           |    136 | SC-ura   |         3 |
| =24hr001_cell6_cell14.jpeg=           |    121 | SC-ura   |         3 |
| =24hr001_cell7_cell15.jpeg=           |    115 | SC-ura   |         3 |
| =24hr001_cell8_cell16.jpeg=           |    111 | SC-ura   |         3 |


* Scripts used to generate the data files

All scripts that begin with the name 'process' were run to generate
data for the Dryad submission using files that will not be submitted
to Dryad. The scripts filter data to contain only the data needed in
the paper and annotate it with the appropriate metadata. Since these
scripts rely on unsubmitted data, they cannot be run but are submitted
to allow the data processing steps to be examined. See above for which
scripts generated which files.

------------------------------------------------------------

- [[file:process-tradeoffs-fig3.R]]
- [[file:process-competitions-fig4.R]]
- [[file:process-liquid-competitions-fig5.R]]
- [[file:process-images-fig6.R]]
- [[file:process-degron-tag-figS1.R]]

* Miscellaneous code

- [[file:functions.R]] - Misc. functions used in the analysis
- [[file:load-libraries.R]] - Loads all the libraries used in the analysis

* <<analyze>> Scripts used to create shared data sets

All scripts that begin with the name 'analyze' are used to process
data in a way that gets reused across multiple figures or code
blocks. These scripts need to be run in order to generate data files used in the statistics section below.

- [[file:analyze-liquid-competitions.R]] - Calculate the fitness
     measurements used in the text
- [[file:analyze-plate-patterns.R]] - Calculate smoothed profiles of
     growth on agar plates

