README.html

<div id="outline-container-orgd6add3a" class="outline-3">
<h3 id="orgd6add3a"><span class="section-number-3">3.4</span> 2017-Maxwell-Magwene-when-sensing-is-gambling-fig6.csv</h3>
<div class="outline-text-3" id="text-3-4">
<p>
This is a file that gives the data used to generate Figure 6. The goal
of this experiment was to determine if mutation altered the
diversification strategies of the <i>plastic</i> strain. This file was
generated by <a href="process-images-fig6.R">process-images-fig6.R</a>, which collates the cropped
image data into a csv file.
</p>

<hr  />

<dl class="org-dl">
<dt>file</dt><dd>Image used to generate the data</dd>
<dt><code>pixels_from_center</code></dt><dd>number of pixels from the center of the plate</dd>
<dt>intensity</dt><dd>Maximum intensity of that "column" of pixels.</dd>
<dt>strain</dt><dd>CMY number of the strain being measured</dd>
<dt>media</dt><dd>The media used to prepare the plate</dd>
<dt>replicate</dt><dd>replicate number</dd>
</dl>
</div>
</div>

<div id="outline-container-org56acdff" class="outline-3">
<h3 id="org56acdff"><span class="section-number-3">3.5</span> 2017-Maxwell-Magwene-when-sensing-is-gambling-figS1a.csv</h3>
<div class="outline-text-3" id="text-3-5">
<p>
These data are optical density readings for cultures of yeast grown in
different concentrations of SC+5FOA media and different concentrations
of estradiol. The goal was to determine which degron tag on URA3 would
allow for conditional growth on both SC-ura and SC+5FOA. This file was
generated by <a href="process-degron-tag-figS1.R">process-degron-tag-figS1.R</a>.
</p>

<hr  />

<dl class="org-dl">
<dt>row</dt><dd>row on 96-well plate</dd>
<dt>col</dt><dd>column on 96-well plate</dd>
<dt>strain</dt><dd>strain number of yeast</dd>
<dt>ura3</dt><dd>genotype of strain at the URA3 locus</dd>
<dt>estradiol</dt><dd>concentration of estradiol in the media</dd>
<dt>X5FOA</dt><dd>concentration of 5FOA in the media</dd>
<dt>value</dt><dd>optical density of the well</dd>
</dl>
</div>
</div>

<div id="outline-container-org87b872d" class="outline-3">
<h3 id="org87b872d"><span class="section-number-3">3.6</span> 2017-Maxwell-Magwene-when-sensing-is-gambling-figS1b.csv</h3>
<div class="outline-text-3" id="text-3-6">
<p>
These data are optical density readings for cultures of yeast grown in
SC-ura media and different concentrations of estradiol. The goal was
to determine which degron tag on URA3 would allow for conditional
growth on both SC-ura and SC+5FOA. This file was generated by
<a href="process-degron-tag-figS1.R">process-degron-tag-figS1.R</a>.
</p>


<dl class="org-dl">
<dt>row</dt><dd>row on 96-well plate</dd>
<dt>col</dt><dd>column on 96-well plate</dd>
<dt>strain</dt><dd>strain number of yeast</dd>
<dt>ura3</dt><dd>genotype of strain at the URA3 locus</dd>
<dt>estradiol</dt><dd>concentration of estradiol in the media</dd>
<dt>value</dt><dd>optical density of the well</dd>
</dl>
</div>
</div>

<div id="outline-container-org743e740" class="outline-3">
<h3 id="org743e740"><span class="section-number-3">3.7</span> jpeg-scans</h3>
<div class="outline-text-3" id="text-3-7">
<p>
These are JPEG files of the original tif files used to produce Figs. 2
and 6. Note that Figure 2 was produced from replicate 1 and Figure 6B
was produced with files from replicate 2.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Meta-data for the raw scans of plates used to generate Fig. 6</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">file</th>
<th scope="col" class="org-right">strain</th>
<th scope="col" class="org-left">media</th>
<th scope="col" class="org-right">replicate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell18_cell28.jpeg</code></td>
<td class="org-right">121</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell20_cell32.jpeg</code></td>
<td class="org-right">136</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell21_cell33.jpeg</code></td>
<td class="org-right">111</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell22_cell34.jpeg</code></td>
<td class="org-right">121</td>
<td class="org-left">SC-ura</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell23_cell35.jpeg</code></td>
<td class="org-right">136</td>
<td class="org-left">SC-ura</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell24_cell36.jpeg</code></td>
<td class="org-right">111</td>
<td class="org-left">SC-ura</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell25_cell37.jpeg</code></td>
<td class="org-right">115</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>pdr5snq2_24hr002_cell26_cell38.jpeg</code></td>
<td class="org-right">115</td>
<td class="org-left">SC-ura</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left"><code>24hr005_cell1_cell2.jpeg</code></td>
<td class="org-right">121</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left"><code>24hr005_cell2_cell3.jpeg</code></td>
<td class="org-right">121</td>
<td class="org-left">SC-ura</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left"><code>24hr005_cell3_cell4.jpeg</code></td>
<td class="org-right">115</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left"><code>24hr005_cell4_cell1.jpeg</code></td>
<td class="org-right">115</td>
<td class="org-left">SC-ura</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell1_cell9.jpeg</code></td>
<td class="org-right">136</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell2_cell10.jpeg</code></td>
<td class="org-right">121</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell3_cell12.jpeg</code></td>
<td class="org-right">115</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell4_cell13.jpeg</code></td>
<td class="org-right">111</td>
<td class="org-left">SC+5FOA</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell5_cell17.jpeg</code></td>
<td class="org-right">136</td>
<td class="org-left">SC-ura</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell6_cell14.jpeg</code></td>
<td class="org-right">121</td>
<td class="org-left">SC-ura</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell7_cell15.jpeg</code></td>
<td class="org-right">115</td>
<td class="org-left">SC-ura</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left"><code>24hr001_cell8_cell16.jpeg</code></td>
<td class="org-right">111</td>
<td class="org-left">SC-ura</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org4d3b818" class="outline-2">
<h2 id="org4d3b818"><span class="section-number-2">4</span> Scripts used to generate the data files</h2>
<div class="outline-text-2" id="text-4">
<p>
All scripts that begin with the name 'process' were run to generate
data for the Dryad submission using files that will not be submitted
to Dryad. The scripts filter data to contain only the data needed in
the paper and annotate it with the appropriate metadata. Since these
scripts rely on unsubmitted data, they cannot be run but are submitted
to allow the data processing steps to be examined. See above for which
scripts generated which files.
</p>

<hr  />

<ul class="org-ul">
<li><a href="process-tradeoffs-fig3.R">process-tradeoffs-fig3.R</a></li>
<li><a href="process-competitions-fig4.R">process-competitions-fig4.R</a></li>
<li><a href="process-liquid-competitions-fig5.R">process-liquid-competitions-fig5.R</a></li>
<li><a href="process-images-fig6.R">process-images-fig6.R</a></li>
<li><a href="process-degron-tag-figS1.R">process-degron-tag-figS1.R</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgece2543" class="outline-2">
<h2 id="orgece2543"><span class="section-number-2">5</span> Miscellaneous code</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="functions.R">functions.R</a> - Misc. functions used in the analysis</li>
<li><a href="load-libraries.R">load-libraries.R</a> - Loads all the libraries used in the analysis</li>
</ul>
</div>
</div>

<div id="outline-container-org8eaa341" class="outline-2">
<h2 id="org8eaa341"><span class="section-number-2">6</span> <a id="org6677d7b"></a> Scripts used to create shared data sets</h2>
<div class="outline-text-2" id="text-6">
<p>
All scripts that begin with the name 'analyze' are used to process
data in a way that gets reused across multiple figures or code
blocks. These scripts need to be run in order to generate data files used in the statistics section below.
</p>

<ul class="org-ul">
<li><a href="analyze-liquid-competitions.R">analyze-liquid-competitions.R</a> - Calculate the fitness
measurements used in the text</li>
<li><a href="analyze-plate-patterns.R">analyze-plate-patterns.R</a> - Calculate smoothed profiles of
growth on agar plates</li>
</ul>
</div>
</div>
