README.org
* <<figs>> Scripts used to generate figures

Each figure panel that contains data was generated using the code
contained in the scripts below.

------------------------------------------------------------

- [[file:generate-figures.R]] - convenience script to generate the
     figures and generate the shared data sets from the raw data
- [[file:figure3.R]] 
- [[file:figure4.R]] 
- [[file:figure5.R]] 
- [[file:figure6.R]] 

* <<results>> Statistics for Results

The following code blocks justify the statistics cited in the main
text. Note that the two scripts in the [[analyze]["Scripts used to create shared
data sets"]] section.

** No detectable cost of plasticity in E1 media
  
#+BEGIN_QUOTE
"In contrast, in E1 media the selection coefficient for the plastic
strain relative to P1 was -0.019 and was not significantly different
than 0 (one sample one-sided t-test; n = 3, p = 0.14)."
#+END_QUOTE


#+BEGIN_SRC R :exports both :results output
cop2_plastic <- read.csv("2017-Maxwell-Magwene-when-sensing-is-gambling-fitness-calculations.csv")
t.test(subset(cop2_plastic, (group_name == "vs-URA3") &
                            (media2 == "SC-ura, with estradiol"))$sT,
       mu = 0,
       alternative="less")
#+END_SRC

#+RESULTS:
#+begin_example

	One Sample t-test

data:  subset(cop2_plastic, (group_name == "vs-URA3") & (media2 == "SC-ura, with estradiol"))$sT
t = -1.4445, df = 2, p-value = 0.1427
alternative hypothesis: true mean is less than 0
95 percent confidence interval:
       -Inf 0.01979217
sample estimates:
 mean of x 
-0.0193775 

#+end_example

** Strong cost of plasticity in E2 media


#+BEGIN_QUOTE
"In E2 liquid media, the selection coefficient for the plastic strain
relative to the P2 strain was -0.14 and was significantly different
than 0 (one sample one-sided t-test; n = 3, p = 0.044), indicating a
cost of plasticity."
#+END_QUOTE

#+BEGIN_SRC R :results output :exports both
cop2_plastic <- read.csv("2017-Maxwell-Magwene-when-sensing-is-gambling-fitness-calculations.csv")
t.test(subset(cop2_plastic, (group_name == "vs-ura3") &
                            (media2 == "SC+5FOA, without estradiol"))$sT,
       mu = 0,
       alternative="less")


#+END_SRC

#+RESULTS:
#+begin_example

	One Sample t-test

data:  subset(cop2_plastic, (group_name == "vs-ura3") & (media2 == "SC+5FOA, without estradiol"))$sT
t = -3.1117, df = 2, p-value = 0.04481
alternative hypothesis: true mean is less than 0
95 percent confidence interval:
         -Inf -0.008839538
sample estimates:
 mean of x 
-0.1434755 

#+end_example

** No significant effect of the fluorescent tag on the cost of plasticity

#+BEGIN_QUOTE
"However, the fluorescent marker did not significantly affect the
number of offspring produced by either of the strains in either E1 or
E2 liquid (Fig. S3)(paired two-sided t-test, n = 3, p > 0.26)"
#+END_QUOTE

#+BEGIN_SRC R :results output :exports both
  source("load-libraries.R")

  theData <- read.csv("2017-Maxwell-Magwene-when-sensing-is-gambling-fig5-and-figS2.csv") %>%
      subset(group_name == "mCherry-vs-GFP") %>%
      subset((media == "SC-ura") & (estradiol == "100nM") |
             (media == "SC+5FOA") & (estradiol == "0nM")) %>%
      transform(generations = log2((50*postselection)/preselection)) %>%
      dcast( replicate + media ~ gate, value.var="generations")
  
  cat("Test for difference in SC-ura:\n------------\n")
  with(subset(theData, media == "SC-ura"),
       t.test(mCherry, GFP, paired=T))
  
  cat("Test for difference in SC+5FOA:\n------------\n")
  with(subset(theData, media == "SC+5FOA"),
       t.test(mCherry, GFP, paired=T))
#+END_SRC

#+RESULTS:
#+begin_example
Test for difference in SC-ura:
------------

	Paired t-test

data:  mCherry and GFP
t = -1.5559, df = 2, p-value = 0.26
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -0.7414909  0.3476474
sample estimates:
mean of the differences 
             -0.1969217 

Test for difference in SC+5FOA:
------------

	Paired t-test

data:  mCherry and GFP
t = 0.38866, df = 2, p-value = 0.735
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -1.020411  1.223062
sample estimates:
mean of the differences 
              0.1013257 

#+end_example

