README.html

<div id="outline-container-org2e02b96" class="outline-2">
<h2 id="org2e02b96"><span class="section-number-2">7</span> <a id="org888a29a"></a> Scripts used to generate figures</h2>
<div class="outline-text-2" id="text-7">
<p>
Each figure panel that contains data was generated using the code
contained in the scripts below.
</p>

<hr  />

<ul class="org-ul">
<li><a href="generate-figures.R">generate-figures.R</a> - convenience script to generate the
figures and generate the shared data sets from the raw data</li>
<li><a href="figure3.R">figure3.R</a></li>
<li><a href="figure4.R">figure4.R</a></li>
<li><a href="figure5.R">figure5.R</a></li>
<li><a href="figure6.R">figure6.R</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6db644f" class="outline-2">
<h2 id="org6db644f"><span class="section-number-2">8</span> <a id="org607a72e"></a> Statistics for Results</h2>
<div class="outline-text-2" id="text-8">
<p>
The following code blocks justify the statistics cited in the main
text. Note that the two scripts in the <a href="#org6677d7b">"Scripts used to create shared
data sets"</a> section.
</p>
</div>

<div id="outline-container-orgac319dd" class="outline-3">
<h3 id="orgac319dd"><span class="section-number-3">8.1</span> No detectable cost of plasticity in E1 media</h3>
<div class="outline-text-3" id="text-8-1">
<blockquote>
<p>
"In contrast, in E1 media the selection coefficient for the plastic
strain relative to P1 was -0.019 and was not significantly different
than 0 (one sample one-sided t-test; n = 3, p = 0.14)."
</p>
</blockquote>


<div class="org-src-container">
<pre class="src src-R">cop2_plastic <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2017-Maxwell-Magwene-when-sensing-is-gambling-fitness-calculations.csv"</span>)
t.test(subset(cop2_plastic, (group_name == <span style="color: #CC5542;">"vs-URA3"</span>) &amp;
                            (media2 == <span style="color: #CC5542;">"SC-ura, with estradiol"</span>))$sT,
       mu = 0,
       alternative=<span style="color: #CC5542;">"less"</span>)
</pre>
</div>

<pre class="example">
	One Sample t-test

data:  subset(cop2_plastic, (group_name == "vs-URA3") &amp; (media2 == "SC-ura, with estradiol"))$sT
t = -1.4445, df = 2, p-value = 0.1427
alternative hypothesis: true mean is less than 0
95 percent confidence interval:
       -Inf 0.01979217
sample estimates:
 mean of x 
-0.0193775
</pre>
</div>
</div>

<div id="outline-container-orgf21fe0e" class="outline-3">
<h3 id="orgf21fe0e"><span class="section-number-3">8.2</span> Strong cost of plasticity in E2 media</h3>
<div class="outline-text-3" id="text-8-2">
<blockquote>
<p>
"In E2 liquid media, the selection coefficient for the plastic strain
relative to the P2 strain was -0.14 and was significantly different
than 0 (one sample one-sided t-test; n = 3, p = 0.044), indicating a
cost of plasticity."
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-R">cop2_plastic <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2017-Maxwell-Magwene-when-sensing-is-gambling-fitness-calculations.csv"</span>)
t.test(subset(cop2_plastic, (group_name == <span style="color: #CC5542;">"vs-ura3"</span>) &amp;
                            (media2 == <span style="color: #CC5542;">"SC+5FOA, without estradiol"</span>))$sT,
       mu = 0,
       alternative=<span style="color: #CC5542;">"less"</span>)
</pre>
</div>

<pre class="example">
	One Sample t-test

data:  subset(cop2_plastic, (group_name == "vs-ura3") &amp; (media2 == "SC+5FOA, without estradiol"))$sT
t = -3.1117, df = 2, p-value = 0.04481
alternative hypothesis: true mean is less than 0
95 percent confidence interval:
         -Inf -0.008839538
sample estimates:
 mean of x 
-0.1434755
</pre>
</div>
</div>

<div id="outline-container-orgeb0cad5" class="outline-3">
<h3 id="orgeb0cad5"><span class="section-number-3">8.3</span> No significant effect of the fluorescent tag on the cost of plasticity</h3>
<div class="outline-text-3" id="text-8-3">
<blockquote>
<p>
"However, the fluorescent marker did not significantly affect the
number of offspring produced by either of the strains in either E1 or
E2 liquid (Fig. S3)(paired two-sided t-test, n = 3, p &gt; 0.26)"
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"load-libraries.R"</span>)

theData <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2017-Maxwell-Magwene-when-sensing-is-gambling-fig5-and-figS2.csv"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset(group_name == <span style="color: #CC5542;">"mCherry-vs-GFP"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset((media == <span style="color: #CC5542;">"SC-ura"</span>) &amp; (estradiol == <span style="color: #CC5542;">"100nM"</span>) |
           (media == <span style="color: #CC5542;">"SC+5FOA"</span>) &amp; (estradiol == <span style="color: #CC5542;">"0nM"</span>)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(generations = log2((50*postselection)/preselection)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    dcast( replicate + media ~ gate, value.var=<span style="color: #CC5542;">"generations"</span>)

cat(<span style="color: #CC5542;">"Test for difference in SC-ura:\n------------\n"</span>)
with(subset(theData, media == <span style="color: #CC5542;">"SC-ura"</span>),
     t.test(mCherry, GFP, paired=T))

cat(<span style="color: #CC5542;">"Test for difference in SC+5FOA:\n------------\n"</span>)
with(subset(theData, media == <span style="color: #CC5542;">"SC+5FOA"</span>),
     t.test(mCherry, GFP, paired=T))
</pre>
</div>

<pre class="example">
Test for difference in SC-ura:
------------

	Paired t-test

data:  mCherry and GFP
t = -1.5559, df = 2, p-value = 0.26
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -0.7414909  0.3476474
sample estimates:
mean of the differences 
             -0.1969217 

Test for difference in SC+5FOA:
------------

	Paired t-test

data:  mCherry and GFP
t = 0.38866, df = 2, p-value = 0.735
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -1.020411  1.223062
sample estimates:
mean of the differences 
              0.1013257
</pre>
</div>
</div>
