README.org
** Mutation alters the diversification strategy of the plastic strain

#+BEGIN_QUOTE
"We used this half-maximum point to estimate the relative proportion
(area) of the environment that each strain was able to occupy. The
genotype plastic(green) occupies 24% ± 1.6% of the E1 agar plates and
69% ± 5.7% of the E2 agar plates. In contrast, a plastic ∆/∆ genotype
occupies 46% ± 8% of the E1 environment and 49% ± 4% of E2 (All
results expressed as means ± 95% CI based on three biological
replicates)."
#+END_QUOTE

#+BEGIN_SRC R :results output :exports both

  source("load-libraries.R")

  im.m.sm <- read.csv("2017-Maxwell-Magwene-when-sensing-is-gambling-smoothed-plate-patterns.csv")

  im.m.sm %>%
    subset( x > 50) %>%
    subset( x < 494) %>%
    ddply(.(strain, media, replicate),
          plyr::summarize,
          halfMax = max(sm)/2,
          pos = 2.54*(x[which(sm <= halfMax)[1]])/360, # Convert to cm
          pos2 =2.54*(x[which(sm >= halfMax)[1]])/360
          ) %>%
    subset(strain %in% c("CMY115", "CMY121")) %>%
    transform( pos = apply( data.frame(pos, pos2), 1, max), pos2=NULL) %>%
    transform( area = pi * ( pos )^2 ) %>%
    transform( percentage = area/(pi*(8.3/2)^2)) %>%
    ddply(.(strain, media), function(x) mean_cl_normal(x$percentage)) %>%
    transform(area.of.center=y,
              plus.minus = y-ymin,
              y = NULL,
              ymin=NULL,
              ymax=NULL) %>%
      transform(strain = factor(strain,
				levels=c("CMY121", "CMY115"),
				labels = c("platic.green", "plastic D/D"))) %>%
      transform(
          area.occupied = round(abs( area.of.center - ifelse(media == "foa", 1, 0)),2),
          plus.minus = round(plus.minus, 3),
          area.of.center = NULL)


#+END_SRC

#+RESULTS:
:         strain media plus.minus area.occupied
: 1  plastic D/D   foa      0.037          0.47
: 2  plastic D/D   ura      0.081          0.46
: 3 platic.green   foa      0.057          0.69
: 4 platic.green   ura      0.017          0.24

* <<session>> Session Info

#+BEGIN_SRC R :exports both :results output
  source("load-libraries.R")
  sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 3.2.3 (2015-12-10)
Platform: x86_64-apple-darwin13.4.0 (64-bit)
Running under: OS X 10.10.5 (Yosemite)

locale:
[1] C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] colortools_0.1.5  wesanderson_0.3.2 magrittr_1.5      reshape2_1.4.1   
[5] plyr_1.8.3        ggplot2_2.1.0    

loaded via a namespace (and not attached):
[1] colorspace_1.2-6 scales_0.4.0     tools_3.2.3      gtable_0.2.0    
[5] Rcpp_0.12.4      stringi_1.0-1    grid_3.2.3       stringr_1.0.0   
[9] munsell_0.4.3   
#+end_example

