README.html

<div id="outline-container-org805b26a" class="outline-3">
<h3 id="org805b26a"><span class="section-number-3">8.4</span> Mutation alters the diversification strategy of the plastic strain</h3>
<div class="outline-text-3" id="text-8-4">
<blockquote>
<p>
"We used this half-maximum point to estimate the relative proportion
(area) of the environment that each strain was able to occupy. The
genotype plastic(green) occupies 24% ± 1.6% of the E1 agar plates and
69% ± 5.7% of the E2 agar plates. In contrast, a plastic ∆/∆ genotype
occupies 46% ± 8% of the E1 environment and 49% ± 4% of E2 (All
results expressed as means ± 95% CI based on three biological
replicates)."
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"load-libraries.R"</span>)

im.m.sm <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2017-Maxwell-Magwene-when-sensing-is-gambling-smoothed-plate-patterns.csv"</span>)

im.m.sm <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  subset( x &gt; 50) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  subset( x &lt; 494) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  ddply(.(strain, media, replicate),
        plyr::summarize,
        halfMax = max(sm)/2,
        pos = 2.54*(x[which(sm &lt;= halfMax)[1]])/360, <span style="color: #6abd50;"># </span><span style="color: #6aaf50;">Convert to cm</span>
        pos2 =2.54*(x[which(sm &gt;= halfMax)[1]])/360
        ) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  subset(strain %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(<span style="color: #CC5542;">"CMY115"</span>, <span style="color: #CC5542;">"CMY121"</span>)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  transform( pos = apply( data.frame(pos, pos2), 1, max), pos2=<span style="color: #528fd1;">NULL</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  transform( area = pi * ( pos )^2 ) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  transform( percentage = area/(pi*(8.3/2)^2)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  ddply(.(strain, media), <span style="color: #7d7c61; font-weight: bold;">function</span>(x) mean_cl_normal(x$percentage)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
  transform(area.of.center=y,
            plus.minus = y-ymin,
            y = <span style="color: #528fd1;">NULL</span>,
            ymin=<span style="color: #528fd1;">NULL</span>,
            ymax=<span style="color: #528fd1;">NULL</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(strain = factor(strain,
                              levels=c(<span style="color: #CC5542;">"CMY121"</span>, <span style="color: #CC5542;">"CMY115"</span>),
                              labels = c(<span style="color: #CC5542;">"platic.green"</span>, <span style="color: #CC5542;">"plastic D/D"</span>))) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(
        area.occupied = round(abs( area.of.center - ifelse(media == <span style="color: #CC5542;">"foa"</span>, 1, 0)),2),
        plus.minus = round(plus.minus, 3),
        area.of.center = <span style="color: #528fd1;">NULL</span>)
</pre>
</div>

<pre class="example">
        strain media plus.minus area.occupied
1  plastic D/D   foa      0.037          0.47
2  plastic D/D   ura      0.081          0.46
3 platic.green   foa      0.057          0.69
4 platic.green   ura      0.017          0.24
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd17b9e" class="outline-2">
<h2 id="orgdd17b9e"><span class="section-number-2">9</span> <a id="orgf32328a"></a> Session Info</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"load-libraries.R"</span>)
sessionInfo()
</pre>
</div>

<pre class="example">
R version 3.2.3 (2015-12-10)
Platform: x86_64-apple-darwin13.4.0 (64-bit)
Running under: OS X 10.10.5 (Yosemite)

locale:
[1] C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] colortools_0.1.5  wesanderson_0.3.2 magrittr_1.5      reshape2_1.4.1   
[5] plyr_1.8.3        ggplot2_2.1.0    

loaded via a namespace (and not attached):
[1] colorspace_1.2-6 scales_0.4.0     tools_3.2.3      gtable_0.2.0    
[5] Rcpp_0.12.4      stringi_1.0-1    grid_3.2.3       stringr_1.0.0   
[9] munsell_0.4.3
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: January 2017</p>
<p class="author">Author: Colin S Maxwell and Paul M Magwene</p>
<p class="date">Created: 2017-01-20 Fri 12:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
